Конфигурация/Documents/MoneyIncome.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>MoneyIncome</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Cash</xr:Item>
				<xr:Item>AccumulationRegister.Debts</xr:Item>
				<xr:Item>AccumulationRegister.RecordCash</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Wallet</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Wallets</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Details</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeleteSum</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeleteExpenditureDDS</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Expenditures</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Debt</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Counterparty</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CounterParties</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Rate</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Repetition</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>User</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SumOfDocument</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PresentationArticle</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Amounts</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Expenditure</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Expenditures</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Sum</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Documents/MoneyIncome/Forms/DocumentForm/Ext/Form/Module.bsl
// CLIENT PROCEDURES AND FUNCTIONS //

&AtClient
Procedure AfterWrite(WriteParameters)
	Notify("RecordDocument");
EndProcedure

&AtClient
Procedure WalletOnChange(Item)
	WalletOnChangeServer();
EndProcedure

&AtClient
Procedure DebtOnChange(Item)
	IF Not Object.Debt Then
		Object.Counterparty = Undefined;
	EndIf;
	RefreshTheView();
EndProcedure

// SERVER PROCEDURES AND FUNCTIONS //

&AtServer
Procedure WalletOnChangeServer ()
	CurrencyWallet = Object.Wallet.Currency;
	RefreshTheView();
EndProcedure	

&AtServer
Procedure RefreshTheView ()
	IF MainCurrency <> CurrencyWallet Then
		Items.GroupRateRepetition.Visible = True;
		RateRepetition = CommonModuleServer.GetRateRepetitionCurrencies(Object.Wallet.Currency, Object.Date); 
		FillPropertyValues(Object,RateRepetition);
	Else
		Rate      = 1;
		Repetition = 1;
		Items.GroupRateRepetition.Visible = False;
	EndIf;	
	Items.Counterparty.Enabled = Object.Debt;
EndProcedure	

// INITIALIZATION OF THE DOCUMENT //

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing) 
	IF Not ValueIsFilled(Object.Ref) Then
		RES = CommonModuleServer.GetDefaultValues(FormAttributeToValue("Object").Metadata().FullName(),"Wallet,Expenditure");
		FillPropertyValues(Object,Res);
		WalletOnChangeServer();
		NewRow = Object.Amounts.Add();
		FillPropertyValues(NewRow,Res);	
	EndIf;
	MainCurrency = Constants.MainCurrency.Get();
	CurrencyWallet = Object.Wallet.Currency;
	RefreshTheView();
	
	SettingOfTheFormsServer.SettingWhenCreatingForms(ThisForm,Object,"Amounts");

EndProcedure

// FORM MANAGEMENT //

// CLIENT PROCEDURES //

&AtClient
Procedure AddString(Command)
	NewRow     = Object.Amounts.Add();
	NewRow.UID = StrReplace(String(New UUID),"-","_");
	CreateRefreshItemsForms();
EndProcedure

&AtClient
Procedure DeleteString(Command)
	UID = StrReplace(Command.Name,"Delete_","");
	DeleteItemsStrings(UID);
EndProcedure

&AtClient
Procedure PropsOnChange (Item)
	SettingFormsClient.PropsOnChange(ThisForm,Object,"Amounts",Item);
EndProcedure	

// SERVER PROCEDURES //

&AtServer
Procedure CreateRefreshItemsForms ()
	SettingOfTheFormsServer.CreateRefreshItemsForms(ThisForm,Object,"Amounts");
EndProcedure	

&AtServer
Procedure DeleteItemsStrings (UID)
	SettingOfTheFormsServer.DeleteItemsStrings(ThisForm,Object,"Amounts",UID);
EndProcedure
